<a href="https://colab.research.google.com/github/julioreis-dev/tutorial_pandas/blob/main/func_melt.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
?pd.melt()

In [ ]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
...                    'B': {0: 1, 1: 3, 2: 5},
...                    'C': {0: 2, 1: 4, 2: 6}})

In [ ]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [ ]:
pd.melt(df,id_vars=['A'],value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [ ]:
pd.melt(df,id_vars=['A'],value_vars=['B'], var_name='variável', value_name='valor')

   A variável  valor
0  a        B      1
1  b        B      3
2  c        B      5

In [ ]:
pd.melt(df,id_vars=['A'],value_vars=['B', 'C'], var_name='variável', value_name='valor')

   A variável  valor
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6